# Rebar Bend Data Crank Ratio 1 Property

Source: https://www.revitapidocs.com/2026/5c0373b8-da6a-4fa5-6f38-c9fbc0a2a7d1.htm

---

| Rebar Bend Data Crank Ratio 1 Property |
| --- |

Identifies the crank ratio at the end. The 1:crankRatio that defines the crank slope.

The default value is 0\. A positive value means that there is a valid crank. If the value is 0 it means that there is no crank. If the value is negative it means that there is a crank with incorrect values.

**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double CrankRatio1 { get; }
```

```
Public ReadOnly Property CrankRatio1 As Double
	Get
```

```
public:
property double CrankRatio1 {
	double get ();
}
```

```
member CrankRatio1 : float with get
```

#### Property Value

Double See Also

#### Reference

RebarBendData Class Autodesk.Revit.DB.Structure Namespace